export const mockInfo = [
    {
        "date": "2025/8/1",
        "type": "记录价格",
        "value": 4623
    },
    {
        "date": "2025/8/1",
        "type": "预测价格",
        "value": 2208
    },
    {
        "date": "2025/8/2",
        "type": "记录价格",
        "value": 6145
    },
    {
        "date": "2025/8/2",
        "type": "预测价格",
        "value": 2016
    },
    {
        "date": "2025/8/3",
        "type": "记录价格",
        "value": 508
    },
    {
        "date": "2025/8/3",
        "type": "预测价格",
        "value": 2916
    },
    {
        "date": "2025/8/4",
        "type": "记录价格",
        "value": 6268
    },
    {
        "date": "2025/8/4",
        "type": "预测价格",
        "value": 4512
    },
    {
        "date": "2025/8/5",
        "type": "记录价格",
        "value": 6411
    },
    {
        "date": "2025/8/5",
        "type": "预测价格",
        "value": 8281
    },
    {
        "date": "2025/8/6",
        "type": "记录价格",
        "value": 1890
    },
    {
        "date": "2025/8/6",
        "type": "预测价格",
        "value": 2008
    },
    {
        "date": "2025/8/7",
        "type": "记录价格",
        "value": 4251
    },
    {
        "date": "2025/8/7",
        "type": "预测价格",
        "value": 1963
    },
    {
        "date": "2025/8/8",
        "type": "记录价格",
        "value": 2978
    },
    {
        "date": "2025/8/8",
        "type": "预测价格",
        "value": 2367
    },
    {
        "date": "2025/8/9",
        "type": "记录价格",
        "value": 3880
    },
    {
        "date": "2025/8/9",
        "type": "预测价格",
        "value": 2956
    },
    {
        "date": "2025/8/10",
        "type": "记录价格",
        "value": 3606
    },
    {
        "date": "2025/8/10",
        "type": "预测价格",
        "value": 678
    },
    {
        "date": "2025/8/11",
        "type": "记录价格",
        "value": 4311
    },
    {
        "date": "2025/8/11",
        "type": "预测价格",
        "value": 3188
    },
    {
        "date": "2025/8/12",
        "type": "记录价格",
        "value": 4116
    },
    {
        "date": "2025/8/12",
        "type": "预测价格",
        "value": 3491
    },
    {
        "date": "2025/8/13",
        "type": "记录价格",
        "value": 6419
    },
    {
        "date": "2025/8/13",
        "type": "预测价格",
        "value": 2852
    },
    {
        "date": "2025/8/14",
        "type": "记录价格",
        "value": 1643
    },
    {
        "date": "2025/8/14",
        "type": "预测价格",
        "value": 4788
    },
    {
        "date": "2025/8/15",
        "type": "记录价格",
        "value": 445
    },
    {
        "date": "2025/8/15",
        "type": "预测价格",
        "value": 4319
    },
]


export const areaMockInfo = 
[
    {
        "date": "18:00",
        "预测电量": 0.00348138677816903
    },
    {
        "date": "18:15",
        "预测电量": -0.00779071607989758
    },
    {
        "date": "18:30",
        "预测电量": 0.00265356275004035
    },
    {
        "date": "18:45",
        "预测电量": 0.0048857802967009
    },
    {
        "date": "19:00",
        "预测电量": -0.0078112017585948
    },
    {
        "date": "19:15",
        "预测电量": 0.00910945756785081
    },
    {
        "date": "19:30",
        "预测电量": 0.0051492272900181
    },
    {
        "date": "19:45",
        "预测电量": -0.00260972126042923
    },
    {
        "date": "20:00",
        "预测电量": 0.00162759391666744
    },
    {
        "date": "20:15",
        "预测电量": 0.00828140289442679
    },
    {
        "date": "20:30",
        "预测电量": 0.00451152587985225
    },
    {
        "date": "20:45",
        "预测电量": -0.0031266194270582
    },
    {
        "date": "21:00",
        "预测电量": -0.00589722591726911
    },
    {
        "date": "21:15",
        "预测电量": -0.0095184304656081
    },
    // {
    //     "date": "21:30",
    //     "预测电量": -1.54184969446708
    // },
    // {
    //     "date": "21:45",
    //     "预测电量": -1.31031245938982
    // },
    // {
    //     "date": "22:00",
    //     "预测电量": -0.00895693067878342
    // }
]